<?php
$reviewsPerTrainer=6;

$trainers=array("Кондрашов Кирилл","Борисов Алексей","Яковлев Александр","Пахомов Максим","Пастухов Роман",
    "Тихонов Артём","Иванов Даниил","Кузнецов Андрей","Озерова Мия","Иванов Фёдор");

$countOfReviews=12;


$reviews=array(
        "text"=>array("Я благодарен своему тренеру за эффективные и интересные тренировки, за внимание и терпение. Не всегда с первого раза получается выполнить упражнение.",
                "Такая поддержка и мотивация! Буду дальше стараться, не сбавлять темпы. Верю, что при таких грамотных тренировках цель близка!",
                "Занимаюсь с тренером полтора месяца и уже не представляю, как может быть иначе. Получаю огромный заряд бодрости, энергии и позитива после каждой тренировки.",
                "У моего наставника всегда невероятно боевой настрой, которым он и меня заряжает. Каждое посещение фитнес-клуба жду с нетерпением!",
                "Прежде чем начать заниматься тренер изучил особенности моего здоровья. При составлении плана тренировок и программы питания, учёл все мои цели. Вот это я понимаю - грамотный подход!",
                "Мне очень повезло с моим тренером. С каждым посещением зала у меня все больше уверенности в своих силах. Продолжаю тренироваться с удовольствием.",
                "Все отлично. Теперь я не остановлюсь на пути к своей цели.",
                "Я благодарен своему тренеру за эффективные и интересные тренировки, за внимание и терпение. Не всегда с первого раза получается выполнить упражнение.",
                "Тренер подробно объясняет и чётко следит за техникой. Такие тренировки я ни на что не променяю.",
                "Тренер отвечает на все вопросы, корректирует технику. Чувствуется, что он профессионал своего дела.",
                "Оценила по достоинству персональные тренировки. Лучше получается сосредоточиться на упражнениях. И изменения стала замечать буквально через две недели. Тренер здесь играет огромную роль.",
                "Мой тренер - опытный специалист, при этом очень тактичный, всегда подберёт правильные слова, чтобы подбодрить, настроить на нужный лад. Ведь я сомневалась, что смогу перебороть себя и прийти в зал. Оказалось, зря.",
                "Рада, что смогла найти своего тренера. Очень нравится индивидуальный подход. Мы сразу нашли общий язык. На тренировках все чётко, понятно."),
        "sex"=>array("m","n","n","n","n","n","n","n","n","f","f","f"));



$viewers=array(
        "surname"=>array("Иванов","Смирнов","Кузнецов","Попов","Васильев","Петров","Соколов","Михайлов","Новиков","Федоров","Морозов","Волков","Алексеев","Лебедев",
    "Семенов","Егоров","Павлов","Козлов","Степанов","Николаев","Орлов","Андреев","Макаров","Никитин","Захаров","Зайцев","Соловьев","Борисов","Яковлев","Григорьев","Романов",
    "Воробьев","Сергеев","Кузьмин","Фролов","Александров","Дмитриев","Королев","Гусев","Киселев","Ильин","Максимов","Поляков","Сорокин","Виноградов","Ковалев","Белов",
    "Медведев","Антонов","Тарасов","Жуков","Баранов","Филиппов","Комаров","Давыдов","Беляев","Герасимов","Богданов","Осипов","Сидоров","Матвеев","Титов","Марков",
    "Миронов","Крылов","Куликов","Карпов","Власов","Мельников","Денисов","Гаврилов","Тихонов","Казаков","Афанасьев","Данилов","Савельев","Тимофеев","Фомин",
    "Чернов","Абрамов","Мартынов","Ефимов","Федотов","Щербаков","Назаров","Калинин","Исаев","Чернышев","Быков","Маслов","Родионов","Коновалов","Лазарев","Воронин",
    "Климов","Филатов","Пономарев","Голубев","Кудрявцев","Прохоров","Наумов","Потапов","Журавлев","Овчинников","Трофимов","Леонов","Соболев","Ермаков"),

        "maleName"=>array("Александр","Дмитрий","Максим","Сергей","Андрей","Алексей","Артём","Илья","Кирилл","Михаил","Никита","Матвей","Роман","Егор","Арсений","Иван",
            "Денис","Евгений","Даниил","Тимофей","Владислав","Игорь","Владимир","Павел","Руслан","Марк","Константин","Тимур","Олег","Ярослав","Антон","Николай","Глеб",
            "Данил","Савелий","Вадим","Степан","Юрий","Богдан","Артур","Семен","Макар","Лев","Виктор","Елисей","Виталий","Вячеслав","Захар","Мирон","Дамир","Георгий",
            "Давид","Платон","Анатолий","Григорий","Демид","Данила","Станислав","Василий","Федор","Родион","Леонид","Одиссей","Валерий","Святослав","Борис","Эдуард",
            "Марат","Герман","Даниэль","Петр","Амир","Всеволод","Мирослав","Гордей","Артемий","Эмиль","Назар","Савва","Ян","Рустам","Игнат","Влад","Альберт","Тамерлан",
            "Айдар","Роберт","Адель","Марсель","Ильдар","Самир","Тихон","Рамиль","Ринат","Радмир","Филипп","Арсен","Ростислав","Святогор","Яромир"),

    "femaleName"=>array("Анастасия","Анна","Мария","Елена","Дарья","Алина","Ирина","Екатерина","Арина","Полина","Ольга","Юлия","Татьяна","Наталья","Виктория","Елизавета",
            "Ксения","Милана","Вероника","Алиса","Валерия","Александра","Ульяна","Кристина","София","Марина","Светлана","Варвара","Софья","Диана","Яна","Кира","Ангелина",
            "Маргарита","Ева","Алёна","Дарина","Карина","Василиса","Олеся","Аделина","Оксана","Таисия","Надежда","Евгения","Элина","Злата","Есения","Милена","Вера",
            "Мирослава","Галина","Людмила","Валентина","Нина","Эмилия","Камилла","Альбина","Лилия","Любовь","Лариса","Эвелина","Инна","Агата","Амелия","Амина","Эльвира",
            "Ярослава","Стефания","Регина","Алла","Виолетта","Лидия","Амалия","Наталия","Марьяна","Анжелика","Нелли","Влада","Виталина","Майя","Тамара","Мелания","Лиана",
            "Василина","Зарина","Алия","Владислава","Самира","Антонина","Ника","Мадина","Наташа","Каролина","Снежана","Юлиана","Ариана","Эльмира","Ясмина","Жанна")
);

//these pointers will be used in ViewersName arrays
$mViewerPointer=0;
$wViewerPointer=0;
function getRandFullName($viewers,$sex)
{
    if ($sex == "n") {
        if (mt_rand(0, 1)) {
            $sex = "m";
        }
        else {
            $sex = "f";
        }
    }

    $viewersNum = count($viewers["maleName"])/2;
    if ($sex == "m") {
        $fullName = $viewers["maleName"][mt_rand(0, $viewersNum/2)] . " ";
    } else {
        $fullName = $viewers["femaleName"][mt_rand(0, $viewersNum)] . " ";
    }
    $fullName .= $viewers["surname"][mt_rand(0, $viewersNum)];
    if ($sex == "f") {
        $fullName .= "а";
    }
    return $fullName;
}



for($i=0;$i<count($trainers);$i++)
{
    echo "Тренер ".$trainers[$i]."<br><br>";

    $ReviewsRandNums=range(0,$countOfReviews-1);
    shuffle($ReviewsRandNums);

        for ($j = 0; $j < $reviewsPerTrainer; $j++) {

            $currentReview=$ReviewsRandNums[$j];
            echo $reviews["text"][$currentReview]."<br>";
            echo getRandFullName($viewers,$reviews["sex"][$currentReview])."<br><br>";

           }
    echo "<br><br>";
}



?>


<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
</head>
<body>
<div align="center">
   </div>

</body>

</html>